# 模块名称：自定义常量
# 创建日期：2020-6
# 最后修改日期：2020-6
# 作者：Jason

from django.db import connection

# 单价类型
bill_type = (
    (0, '采购入库'),
    (1, '采购退货出库'),
    (2, '销售出库'),
    (3, '销售退货入库'),
    (4, '租用出库'),
    (5, '回收入库'),
    (6, '维修领用出库'),
    (7, '维修返回入库'),
    (8, '调拨出库'),
    (9, '调拨入库'),
    (10, '历史库存入库'),

)


# 备件类别
device_type = (
    (0, '新购'),
    (1, '回收'),
)

# 潜在客户状态
customersLatent_status = (
    (0, '跟进中'),
    (1, '已签约'),
)

# 合同类型
Contract_type = (
    (0, '维护服务类'),
    (1, '产品销售类'),
)

# 合同项目状态
customersSign_status = (
    (0, '维护中'),
    (1, '结束'),
)

# 合同收款情况
contract_paystatus = (
    (0, '未收款'),
    (1, '已收款'),
)

# 项目需求是否解决
virtual_choice = (
    (0, '否'),
    (1, '是'),
)

# 紧急程度
virtual_important = (
    (0, '一般'),
    (1, '紧急'),
)

# 单据状态
virtual_status = (
    (0, '待提交'),
    (1, '采购中'),
    (2, '待下单'),
    (3, '已下单'),
    (4, '待入库'),
    (5, '已入库'),
    (6, '待出库'),
    (7, '已出库'),
    (8, '部分入库'),
    (9, '部分出库'),
    (10, '待出入库'),


)

# 出入库类型
stock_type = (
    (0, '入库'),
    (1, '出库'),
)